benchmark-http-server-epoll-new-conventions.txt
=== OLD http-serve (call-with-errno) ===
Started: 2026-03-18T18:17:39+01:00
Running 10s test @ http://127.0.0.1:9876/
  4 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.80ms   73.19ms   1.53s    99.33%
    Req/Sec     2.74k     2.83k   26.58k    92.75%
  109224 requests in 10.02s, 5.73MB read
  Socket errors: connect 0, read 0, write 0, timeout 24
Requests/sec:  10904.98
Transfer/sec:    585.72KB

=== NEW http-serve (__atomic __disable_interrupts __errno) ===
Started: 2026-03-18T18:17:53+01:00
Running 10s test @ http://127.0.0.1:9876/
  4 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.78ms   35.37ms   1.17s    99.26%
    Req/Sec     2.86k     3.06k   29.19k    92.00%
  113821 requests in 10.02s, 5.97MB read
  Socket errors: connect 0, read 0, write 0, timeout 27
Requests/sec:  11361.44
Transfer/sec:    610.23KB

Done: 2026-03-18T18:18:07+01:00